#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time     : 2019/12/10  下午 15:00
# @Author   : Alan_luo
# @Site     :
# @File     : MatchingCard.py
# @Purpose  :
# @Software : PyCharm
# @Copyright:   (c)  2019
# @Licence  :     <your licence>

import requests

dict_ddz = {'方块A': '0x01,', '方块2': '0x02,', '方块3': '0x03,', '方块4': '0x04,', '方块5': '0x05,', '方块6': '0x06,',
            '方块7': '0x07,', '方块8': '0x08,', '方块9': '0x09,', '方块10': '0x0A,', '方块J': '0x0B,', '方块Q': '0x0C,',
            '方块K': '0x0D,', '梅花A': '0x11,', '梅花2': '0x12,', '梅花3': '0x13,', '梅花4': '0x14,', '梅花5': '0x15,',
            '梅花6': '0x16,', '梅花7': '0x17,', '梅花8': '0x18,', '梅花9': '0x19,', '梅花10': '0x1A,', '梅花J': '0x1B,',
            '梅花Q': '0x1C,', '梅花K': '0x1D,', '红桃A': '0x21,', '红桃2': '0x22,', '红桃3': '0x23,', '红桃4': '0x24,',
            '红桃5': '0x25,', '红桃6': '0x26,', '红桃7': '0x27,', '红桃8': '0x28,', '红桃9': '0x29,', '红桃10': '0x2A,',
            '红桃J': '0x2B,', '红桃Q': '0x2C,', '红桃K': '0x2D,', '黑桃A': '0x31,', '黑桃2': '0x32,', '黑桃3': '0x33,',
            '黑桃4': '0x34,', '黑桃5': '0x35,', '黑桃6': '0x36,', '黑桃7': '0x37,', '黑桃8': '0x38,', '黑桃9': '0x39,',
            '黑桃10': '0x3A,', '黑桃J': '0x3B,', '黑桃Q': '0x3C,', '黑桃K': '0x3D,', '小王': '0x4E,', '大王': '0x4F,'}
url = "http://10.0.0.32:6800/config?"
gameID = '4095'
cardID = '11,11,11,12,12,12,13,13,13,14,14,14,15'
print(url+'user_id'+gameID+'&maj='+cardID)
res = requests.get(url+'user_id='+gameID+'&maj='+cardID)
print(res.text)